# Lab 3.1. Tạo bảng, chèn và truy vấn dữ liệu

Đầu tiên chúng ta phải mở cmd lên và chạy các lệnh sau

- pip install pandas
- pip install pymysql
- pip install ipython-sql
- pip install "mysqlclient==1.3.12"

Lưu ý để không phát sinh lỗi trong quá trình cài đặt, bài Lab đang được cài đặt ở môi trường window và với phiên bản python là python 3.6.8 (các lab 3.1, 3.2, 3.3).

Sau khi cài đặt xong, chúng ta sẽ tiến hành import thư viện pymysql.

In [ ]:
import pymysql
import pandas as pd

In [14]:

!pip install "mysqlclient"

Collecting mysqlclient
  Using cached mysqlclient-2.1.1.tar.gz (88 kB)
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (setup.py) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.1.1-cp39-cp39-macosx_10_9_x86_64.whl size=54213 sha256=9056c70b366a78cde59ec89c547f619e92fa4c5570cde719a90753a610b4f8af
  Stored in directory: /Users/macbook/Library/Caches/pip/wheels/f3/a5/27/c6312d8008951cfd5511684378a9e057b82006c70e1fea6107
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.1.1

Lưu ý là đầu tiên để thực hiện Lab chúng ta phải tiến hành mở dịch vụ MySql và Apache trong XAMPP.

Để có thể kết nối Database ta sẽ phải có tài khoản truy cập, ta sẽ lấy tài khoản truy cập bằng cách chọn vào tab "Các tài khoản người dùng" trong trong phpMyAdmin. Ở ví dụ dưới chúng ta đang sử dụng tài khoản với username là root và không có password.

In [ ]:
import pymysql
import pandas as pd

conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd='',db='hr')

df=pd.read_sql_query("SELECT * FROM EMPLOYEES ",conn)
df

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7
8,E1009,Andrea,Jones,123414,1990-07-09,F,"120 Fall Creek, Gary,IL",234,70000.0,30003,7
9,E1010,Ann,Jacob,123415,1982-03-30,F,"111 Britany Springs,Elgin,IL",220,70000.0,30004,5